{
  "title": "Tom Tales",
  "href": "/songs/song/343/Tom_Tales/",
  "album": "Glitter and Doom Live",
  "lyrics": [
    "Okay, alright, thank you, alright… now we can chat a bit. Okay, um, this is really weird. You know, vultures, I’ve seen a lot of vultures since I’ve entered the Texas border, a lot of vultures. The interesting thing about vultures is that, well, the reason they spend so much time in the air is because they’re so light because they eat so infrequently. So they’re mostly feathers, so a lot of times you’ll see them doing this and you’ll think “Oh, he’s probably going to land soon and eat,” but a lot of times he’s thinking to himself “How the fuck am I gonna get down there?” Now here’s the sad part and imagine if you had to make the same choice yourself. After dining, and frankly most vultures that are injured, this is according to the Bird Rescue… most vultures that are injured were injured while dining. That’s kinda sad… to be hit by a car while you’re eating, but the problem is that once they’ve landed and they’d eaten a lot, they eat so much cause they eat so infrequently, they eat so much that they can’t take off without throwing up. I know, that’s tough… so what a choice, you know, you just had a big meal and you have to lose the whole damn thing just to get back up in the sky again. I think of that all the time when I’m having hard times.",
    "Here’s another interesting thing about them, the gas company has started using them to spot gas leaks in the field, because, well… think about it. They think it’s a dead animal but it’s just a gas leak, you know, so they gather… anyway, I find it interesting anyway. Okay, enough about me. Okay, uh, one last thing… you know during World War II, they made, this is in Germany… they made a soup, like an alphabet soup, only instead of the alphabet it was swastikas and they called it pastika soup and apparently it was very popular in Berlin. I’m sorry about that one too.",
    "Okay, here’s something really interesting, I found interesting anyway. You know, rats don’t eat because they are hungry… they’re just grinding down their teeth, and if you don’t believe that, well… my dad found a rat in a room, a concrete room where there was absolutely nothing to eat, not even a rock… and he’d been in there for two weeks and hadn’t had nothing to eat. What happened with his lower teeth is they’d grown through the roof of his mouth and had come out through the top of his head and his uppers had gone down through his chin and they looked like a little goatee. I know, I know… it’s hard to find people that are as interested in these things as I am.",
    "One last thing. Now, they found out that elephants in India, you know they have to wear a big bell around their necks so people know where they are all the time, and you can imagine how fucking annoying that must be, you know, especially in the middle of the night when you’re hungry. So now, elephants scoop up a big hunk of mud and they stick it in the bell to dampen the clapper and then they go off in the middle of the night and steal bananas. Pretty good.",
    "Okay, well… we were in Oklahoma for a while, boy it’s weird in Oklahoma… well it’s weird everywhere if you think of it like that but in Oklahoma, they’ve got laws, there’s laws down there that are still on the books that they feel compelled to enforce. That’s what bothers me and I’m not traveling with an attorney so it makes it difficult, you know, you can’t wash your car on Sunday using wooled underwear, especially if you are wearing an unusual haircut. I never got the connection there between the haircut and the underwear… the other thing that’s weird is that chewing tobacco is strictly enforced, that took some getting used to. Uh, what else? You can’t photograph a rabbit in the middle of the week for some reason, it’s okay on the weekends, I guess they like it better on the weekends… I don’t get it. The other thing is you can’t eat some place that is also on fire. That really limited our choices. Okay, uh, let’s see… there’s something else, here’s another weird one… you can’t get a fish drunk in Oklahoma. They just had a lot of problems with that, they finally had to put an end to it… and you can’t make a monkey smoke a cigarette, that’s the other thing… I know, I know, I know…",
    "Okay, let’s see. Do you know that shrimp, this is really disturbing though, but shrimp... they never give anything to charity. I’ve never known a shrimp to give anything to charity and it’s always bothered me and finally someone told me that basically they’re shellfish and it’s gonna happen… okay, I knew I went too far with that. Thank you for putting a stop to it. Okay, does anybody out there have a parrot? Do you own a parrot is the question. Does anybody in the whole audience own a parrot? Okay, well then you can understand why I went on E-Bay and bought a year’s supplies of parrot diapers. Man, I’m telling you… parrots, I like the conversations; I like the fellowship, but damn… get a grip. Here’s a theory that I have and I’ll run it by you because you’re here… my theory is that if everybody in China, on the very same day, at the very same time, on the very same day, got up on a ladder and jumped as high as they could and came down on the ground, you know, that it would throw the whole Earth off its axis. I haven’t been able to get anybody to go with me with that, like the United Nations or anything… uh, anyway, we should be ready on our side. We’ll pick a day, buy a ladder, get ready… uh, just to keep things… okay.",
    "Okay, what else? Oh, the graveyard shift. Now, when I was a kid I always worked jobs at night and I always had graveyard shifts and everybody kind of threw that expression around very loosely and I wondered what the hell is a graveyard shift is anyway? Other than the fact that you’re working at night, okay I know that much, but what’s the origin of the expression graveyard shift? And then I worked for a while in a graveyard and my boss, Joe Corvello, he explained it to me. What happened in the old days, way, way, way back, hundreds of years ago, people were very nervous about being buried alive, not anymore nervous than we are today it’s just that the technology was not really with it, you could be taking a nap and they’d fucking bury you. So, there was a law that everybody who got buried had to have a string tied around their wrist in the coffin and then they’d run it up through the roof of the coffin and then they’d go up through the dirt and then they’d go over the branch of a tree on which they’d put a bell… and then there’s a guy who sits in the graveyard all night long waiting to hear a bell… that’s the graveyard shift. You’ll like this one too… the bell and the whole apparatus and everything, you know if you find the guy who actually is alive and underground, he’s called a dead ringer. I’m not kidding.",
    "You know, about a year ago… this is really weird and I don’t tell everybody this… during the summer I ingested some pond water, you know, and it’s the weirdest thing… a couple of days later I started to feel something moving in there. I thought, am I pregnant? I don’t know… Anyway, several months went by and I finally had to go to the doctor and they put an ultrasound on me and they found three toads in my stomach… oh boy. But you know they’re off to themselves, they’re off to one side, and you know… why put them on such a bummer… it’s only a drag when we’re watching television and they get really loud and other than that, you know, I’m fine with it, it’s just a thing.",
    "Okay, who has the largest brain in proportion to its body? No, no, no… the ant, swear to god. Who has the largest penis in proportion to its body? No, no, no, no… the barnacle, thank you. Okay, we’ll get on to some actual songs in a minute here… there are more insects in one square mile of Earth then there are people on the entire Earth, think about that, more insects in one square mile than there are people! Imagine if they got to vote or drivers licenses or anything… now, um, you know what the moon smells like? (People yell: “cheese!”) Wrong again, you’ll love this… fireworks. That’s what Neil Armstrong told me, “It smells just like fireworks, man.” And it makes perfect sense, doesn’t it? That’s where we’ve been shooting them for all these years. He says it’s just crazy up there with the fireworks… Do you know how many omelets you can get out of an ostrich egg? Fourteen… that’s a lot of omelets. I’ve gotten along with most of the ostriches I met and um okay… let’s see…",
    "Here’s one… you know the word “bamboozled”… didn’t you ever wonder what the hell they mean when they say “bamboozled”… well way, way, way back, thousands of years ago in China when you got busted for something, they take a piece of bamboo and they’d whack you. You know if you took like fourteen candy bars, you get fourteen whacks. You see the connection though? Bamboozled, bamboo, bamboo, bamboozled… okay, that’s all. One last thing about Sara Bernhardt, the famous American actress… hey, she was a babe, man… she was a total babe. She had her own train car, she slept in a coffin and when she was seventy, she was playing Juliet, babe. Think about that, Juliet… at seventy… and she lost a leg and when she lost her leg, Barnum and Bailey bought her leg, of course… and put it in formaldehyde and charged like, six, eight bucks to come see it. And that was depressing for her, of course… cause she was working across the street, you know, the full her… and to know that your leg is over there making more money than you was so depressing for her… but that’s the business, that’s the business that we’re in. One day, Moe Green got a bullet in the eye but this is the business that we’re in. (Man yells: “Hey Tom, I want to have your baby.” Oh Jesus… well you know, nowadays, I think it’s possible. See my manager, Stuart Ross, but I gotta tell you, my sperm is very expensive now. I’m like a fucking race horse, baby.",
    "Have you’ve wondered why you can never swat a fly? How do they know we’re coming? They don’t know what a swatter is. Do they say “Yeah, swatter coming, swatter coming…”They have no idea what a swatter is. I’ll tell you what happens… they take off backwards. It’s that simple… they’ve taken off backwards their entire lives… okay, that’s all. (Audience members yelling) Uh, my health? My health is fine… you know what, write it down and pass it forward and I’ll take a look at it.",
    "Anyway, Neil Armstrong was the first man on the moon who actually walked on the moon and the guy right behind him on the ladder going down to get to the surface of the moon, now that was Buzz Aldrin… he said “Neil, you are the first man to walk on the moon… I am the very first man to wet his pants on the moon.” He said that, really, he did. He said it to me personally. I know Neil and I know Buzz, so there… and you don’t… okay. But then again, Science Magazine said that the compression of actual moon rocks, the closest thing that they can find on Earth that is closest to the compression of the rocks from the moon is provolone cheese or Vermont cheddar… I’m not shitting you, I wouldn’t shit you… and pig fetuses, you know, they are injecting pig fetuses now with human hormones because they want to use their organs to transplant them into humans so they want to give them some kind of humanistic juice in there so that when the transfer happens, it’ll be a little more commensurate with the… it’s crazy. But now pigs, the fetuses are being born with strangely human faces… one looked just like my Uncle Phil, exactly like my Uncle Phil, even Phil said it looked like him. Ok, I know, I know… we’ll get on, we’ll get on, we’ll get on… What was that for? Because we’re getting on, right? Oh, I see… you’re trying to push me into a song… I know that trick. You know the problem here? The problem here is you guys have never worked together before and you have no actual elected officials so it’s kind of like the early days of America, you know, and everybody’s kind of yelling shit out and somebody’s going “Shut up, shut up…” What? See… you have no President; this is what we call Marshall law.",
    "Ah, okay, do you want another little story or a song? What do you want? That sounded like a cross between a story and a song… you see you can’t get all in line… get in line, babe. Okay, alright, it’s up to me, that’s it… I’m gonna have to take over… Oh, oh, way down in Oklahoma we went to the Spam museum, that was really amazing. They’ve got stuff carved out of Spam, they have portraits of people carved out of Spam… never seen anything like it, but as a Spam fan, I took some of that home with me and I got some of that in my living room and all like little portraits, you know, and “Whoa, whoa… what is that Tom, what is that?” and I said: “Whoa, it’s Spam, it’s Spam”. The thing is it never really deteriorates, the smell is not like it’s decomposing… it’s impossible for it to decompose… and that’s what you’re smelling is really the freshness of it, the eternal freshness of it… it’s kind of embalmed meat is what it really is… what? Oh, oh, oh…I read today that one out of every ten men is important. One out of every ten… and then I realized I read it wrong, I went back and it said “One out of every ten men is impotent”. I don’t know how I changed… I left the R out… so which are you, are you important or are you impotent? I guess that’s all there is to choose from.",
    "I don’t know about you but I spent my entire day at the lost baggage center, you know, have you ever been over there? Fascinating… how they advertise it… things from all over the world… at incredible prices. Its lost baggage is basically what it is… if you ever have lost a bag, your bag is there being sold to somebody else… and it’s right here in Birmingham, I swear to God. So, here’s the ironic thing… I flew in to go to the last baggage center early so that I could shop for basically underwear and socks and they lost my bag. Isn’t that crazy? Okay… here’s one that maybe you’ll like… spiders, spiders, our little eight legged friends, the spider… when the male spider is done building his web, you know those elaborately beautiful webs that they build at night while you’re sleeping and you wake up in the morning and it’s glistening and beautiful like that… when he’s done building the web, he reaches out one of his legs… we assume it’s a leg that he’s reaching out, not certain but we assume it’s a leg… and he strums the web and the sound that that makes… that’s not the actual sound, how could I know the actual sound? But it’s not bad, is it? I mean, if you were a female spider, you’d be like… anyway, what happens is that the sound that the web makes is irresistible to the female spider and she comes… some of them come in from different states when they hear that and they get in line for the big guy. Anyway, it’s just kind of a kooky thing that happens in the world.",
    "In Oklahoma, you can get in trouble for kissing a stranger. Think about that, I mean you can go to jail for kissing a stranger. I mean, we’re all strangers at a certain point, how could the world continue if somebody didn’t kiss a stranger, right? But, uh, I travel with an attorney so… here’s another thing; you know that a mink and an ermine are the same thing? And you know that a mink and an ermine are all members of the weasel family? And if you see a beautiful woman wearing a mink, you can walk right up to her and say “I love your weasel.” And she can’t slap you… I mean, theoretically she can’t slap you. I would do it with an attorney present at all times… so every time in the world there’s a male ejaculation, I know that’s a tough word so from now on we’re just gonna say “it”… whenever “it” happens, it releases two hundred and fifty million sperm… now only one of those sperm obviously can actually fertilize the egg… so if you’re here, you’re already a winner. You know what I mean? That’s the way I see it.",
    "Okay, here’s a little story for everybody now… you know what really gets me? I was in a community, let’s just say it was a bad neighborhood and I used to refer to it and I’d say 9th and Hennepin, boy, 9th and Hennepin… here’s what bothers me, they really cleaned the place up and every time I said 9th and Hennepin, people looked at me like I was doing card tricks for a dog… and some guy would say “You know my wife, she got some sandals down there… they have a little frozen yogurt place”. And I went: “You could get killed for sandals down there!”",
    "Anyway… okay, you know I’ve always been a word guy, I like weird words and I like American slang and all that and words that are no longer being used… I like to drag them out of the box and wave them around… this is an interesting one, it’s amazing how in addition to punctuation just a little pause in the wrong place can just completely transform the meaning of something. I’ll give you a really good example… you know, you’re at the ball game and you got your hot dog and you look around and say “Where are all the condiments?” and they point over there and you go “Oh, okay there’s the condiments.” I’m so glad that they said it like that because when I said it I heard “Where are the condom mints?” That’s just me and I have to live with me. I didn’t say it back to her or she would have slapped me but then I thought that’s not a bad idea… someone could get a hold of something like that and come up with a whole new product… I just offer it to you tonight and we’ll just wait and see what happens.",
    "I made one really ridiculous purchase… you know this is really weird… somebody took a picture of me and they got a picture of my watch, you know, and they said “Well he was wearing a really ratty suit but I think he had about $300,000 watch on. I really got a kick out of that… $9.99 at CVS, but hey, if it looks like $300,000, it is! I’m in show business. (Audience member yells: play everything!) Everything? Play everything? I don’t have that much time. I was out there earlier and I sat in some of those chairs you’re sitting in now… pretty damn comfortable, maybe a little too comfortable. You have your own TV? You mean in the chair? You see some of the seats are better than others… she has a VCR and an I-Pod thing you can hook into. Does your chair vibrate? That’s the vibrating chair. I heard it’s against the law to have an unusual haircut here… and you can’t buy booze without a note from your wife. That’s really weird… I travel with an attorney, of course…",
    "Here’s another thing… a little food thing. You know how every time you get a piece of fish they give you a little piece of lemon with it and everybody thinks that it’s because the flavor is so much better with lemon on it… untrue. The idea was when people ate fish originally, they were so afraid of ingesting bones and having the bone caught in their throat and dying, somebody told them if you put a little lemon in your mouth after you have a bite of fish, it will kill the bone, it’ll dissolve the bone, it’ll just disintegrate the bone, which of course is total bullshit but that’s what happened and now we’ve got lemon and fish and all that… I had a math teacher when I was a kid whose name was Mr. Falby and he had a piece of fish during a test we were having and he choked on a fish bone and he died in the middle of our math test… it was kind of an answer to a prayer that I made earlier. It wasn’t that specific… I didn’t mention anything about the fish or the bone or even on that day… but we have a connection I guess.",
    "I’m sorry, what? You’re still working at the airport? I’m happy for you. I’ll see you on our way out. Here’s a deal… pardon me? Piano is just on beer and wine now. You know what really bothers me is when somebody tells you that their cell phone is also a camera. I just hate that. What’s wrong with having something that’s just what it is and being happy about it? It makes me want to say to them… “My sunglasses are also a tricycle.” But I don’t… okay, we’ve been traveling for about two months now so the laws change from community to community. It’s just bizarre the kind of laws that are still on the books… that’s one of the laws here in Edinbourough that you can no longer order eggs and sausage and it’s sad but it’s just the way it happened with that new mayor. What do we have, what do we have, what do we have? Oh we were gonna try and do this one, we’ll see, this is um…",
    "(Plays song)"
  ]
}